**Python Basics**

In [72]:
#Print Hello world.
print('Hello World')

Hello World

In [3]:
#Get working directory address.
import os
print(os.getcwd())

/Users/mht/Desktop

In [6]:
import platform
print(platform.platform())
print('\n')
print(platform.version())
print('\n')
print(platform.system())
print('\n')
print(platform.release())

macOS-10.16-x86_64-i386-64bit


Darwin Kernel Version 21.6.0: Wed Oct  4 23:55:28 PDT 2023; root:xnu-8020.240.18.704.15~1/RELEASE_X86_64


Darwin


21.6.0

In [7]:
#Arithmetic operations:
print(10 + 4)
print(10 / 4)
print(10 * 4)
print(10 % 4)

14
2.5
40
2

In [8]:
#Multiple assignment:
a, b = 10, 14
print(a)
print(b)

10
14

In [11]:
#Swapping of two numbers.
a, b = 2, 4
print('The first number is {}.'.format(a))
print('The second number is {}.'.format(b))
print('\n')
b,a = a,b
print('Results after swapping:')
print('The first number is {}.'.format(a))
print('The second number is {}.'.format(b))

The first number is 2.
The second number is 4.


Results after swapping:
The first number is 4.
The second number is 2.

In [12]:
#Data Structures in Python.
#1. Tuple
first_tuple = (1, 2.5, 'Mohit', True, None, (1,2))
print(first_tuple)
print(first_tuple[0])
print(first_tuple[1])
print(first_tuple[-1])
print(first_tuple[-2])
print(first_tuple[0:3])
print(first_tuple[0:5:2])
print(first_tuple[::-1])
print(first_tuple[::-2])

(1, 2.5, 'Mohit', True, None, (1, 2))
1
2.5
(1, 2)
None
(1, 2.5, 'Mohit')
(1, 'Mohit', None)
((1, 2), None, True, 'Mohit', 2.5, 1)
((1, 2), True, 2.5)

In [29]:
#2. List
first_list = [1, 2.4, 'Anu', True, None, (1,2), [3,4,5,6]]
print(first_list)
print(first_list[0])
print(first_list[1])
print(first_list[0:4])
print(first_list[0:4:2])
print(first_list[::-1])
print(first_list[::-2])
print(first_list[-1])

[1, 2.4, 'Anu', True, None, (1, 2), [3, 4, 5, 6]]
1
2.4
[1, 2.4, 'Anu', True]
[1, 'Anu']
[[3, 4, 5, 6], (1, 2), None, True, 'Anu', 2.4, 1]
[[3, 4, 5, 6], None, 'Anu', 1]
[3, 4, 5, 6]

In [30]:
#Operations on list.
first_list.append(1)
first_list.append(True)
first_list.append('Mohit')
first_list.append((90,80))
first_list.append([70,60])
print(first_list)

[1, 2.4, 'Anu', True, None, (1, 2), [3, 4, 5, 6], 1, True, 'Mohit', (90, 80), [70, 60]]

In [31]:
first_list.pop(1)
first_list.insert(1,3.5)
first_list.remove((1,2))
print(first_list)

[1, 3.5, 'Anu', True, None, [3, 4, 5, 6], 1, True, 'Mohit', (90, 80), [70, 60]]

In [14]:
#3. Sets
set_1 = {1,2,2,4,4,4,5,5,8}
set_2 = {1,3,4,6,7,8}
print(set_1)
print(set_2)

{1, 2, 4, 5, 8}
{1, 3, 4, 6, 7, 8}

In [16]:
#Operations on sets.
print(set_1 | set_2)
print(set_1 & set_2)
print(set_1 - set_2)
print(set_2 - set_1)

{1, 2, 3, 4, 5, 6, 7, 8}
{8, 1, 4}
{2, 5}
{3, 6, 7}

In [32]:
#4. Dictionaries
first_dict = {'a': 500, 'b': 600}
print(first_dict)
print(first_dict.keys())
print(first_dict.values())
print(first_dict['a'])
print(first_dict['b'])

{'a': 500, 'b': 600}
dict_keys(['a', 'b'])
dict_values([500, 600])
500
600

In [33]:
#operations on dictionary.
first_dict['c'] = 1000
print(first_dict)
print('\n')
del first_dict['b']
print(first_dict)

{'a': 500, 'b': 600, 'c': 1000}


{'a': 500, 'c': 1000}

In [35]:
second_dict = {'India': ['Jharkhand', 'Delhi', 'West Bengal'],
              'UK': ['England', 'Londoan'],
              'United States': ['New York', 'Los Angles', 'California']}
print(second_dict)
print('\n')
print(second_dict['India'])
print('\n')
print(second_dict.keys())
print('\n')
print(second_dict.values())

{'India': ['Jharkhand', 'Delhi', 'West Bengal'], 'UK': ['England', 'Londoan'], 'United States': ['New York', 'Los Angles', 'California']}


['Jharkhand', 'Delhi', 'West Bengal']


dict_keys(['India', 'UK', 'United States'])


dict_values([['Jharkhand', 'Delhi', 'West Bengal'], ['England', 'Londoan'], ['New York', 'Los Angles', 'California']])

In [38]:
#Nested Dictionary.
gdp_year = {'2017':{'USA': 1000, 'India': 800}, '2018':{'USA': 1100, 'India': 850}}
print(gdp_year)
print('\n')
print(gdp_year['2017'])
print('\n')
print(gdp_year['2017']['USA'])

{'2017': {'USA': 1000, 'India': 800}, '2018': {'USA': 1100, 'India': 850}}


{'USA': 1000, 'India': 800}


1000

In [40]:
#Functions in Python.
#First function
def first_fun():
    print('Hello! from first fuction.')

first_fun()

Hello! from first fuction.

In [41]:
#Function that return nothing.
def null_fun():
    pass
null_fun()

In [42]:
#Function that take argument.
def arg_fun(arg):
    print('Hello! from ' + arg)
arg_fun('Mohit')

Hello! from Mohit

In [45]:
#Area of a rectangle.
def area_rectangle(l,b):
    area = l * b
    print('The area of rectangle is {}.'.format(area))
area_rectangle(10,20)
print(type(area_rectangle(10,20)))

The area of rectangle is 200.
The area of rectangle is 200.
<class 'NoneType'>

In [46]:
def area_rectangle(l,b):
    area = l * b
    return area
area_rectangle(20,30)

600

In [47]:
#Can vote function.
def can_vote_fun(age):
    if age >= 18:
        print('Elegible to vote')
    else:
        print('Not elegible to vote')
can_vote_fun(19)

Elegible to vote

In [48]:
#Grade function:
def grade_fun(marks):
    if marks >= 90:
        print('Grade A')
    elif marks >= 80:
        print('Grade B')
    elif marks >= 70:
        print('Grade C')
    elif marks >= 60:
        print('Grade D')
    else:
        print('Grade E')
        
grade_fun(85)

Grade B

In [54]:
def division_fun(a,b):
    try:
        return a/b
    except ZeroDivisionError:
        print("Can't divide by zero")
    except TypeError:
        print("Can't divide by string")

print(division_fun(10,2))
print('\n')
print(division_fun(10,0))
print('\n')
print(division_fun(10,'Mohit'))

5.0


Can't divide by zero
None


Can't divide by string
None

In [65]:
a = [2,3,4,5,6]
list(enumerate(a))

[(0, 2), (1, 3), (2, 4), (3, 5), (4, 6)]

In [66]:
b = [20,30,40,50,60]
print(list(enumerate(b)))

[(0, 20), (1, 30), (2, 40), (3, 50), (4, 60)]

In [58]:
print(list(zip(a,b)))

[(2, 20), (3, 30), (4, 40), (5, 50), (6, 60)]

In [67]:
for i, j in enumerate(a):
    print(i,j)

0 2
1 3
2 4
3 5
4 6

In [71]:
for i, j in zip(a,b):
    print(j / i)

10.0
10.0
10.0
10.0
10.0

**Numpy**

In [73]:
distance = [100, 150, 300, 500]
time = [5, 10, 10, 20]

In [75]:
#speed = distance/time

In [76]:
import numpy as np

In [77]:
np_distance = np.array(distance)
np_time = np.array(time)
speed = np_distance/np_time
print(np_distance)
print(type(np_distance))
print(np_time)
print(type(np_time))
print(speed)
print(type(speed))

[100 150 300 500]
<class 'numpy.ndarray'>
[ 5 10 10 20]
<class 'numpy.ndarray'>
[20. 15. 30. 25.]
<class 'numpy.ndarray'>

In [78]:
#1D, 2D, 3D array.
one_darray = np.array([10,20,30,40,50])
two_darray = np.array([[1,2,3,4],[10,9,8,7]])
three_darray = np.array([[[10,11,12],[13,14,15]],[[1,1,2],[3,4,5]]])

In [79]:
#Operations on 1D array.
print(one_darray.ndim)
print(one_darray.shape)
print(one_darray.size)
print(one_darray.dtype)

1
(5,)
5
int64

In [81]:
print(one_darray)
print(one_darray[0])
print(one_darray[1])
print(one_darray[0:3])
print(one_darray[0:4:2])
print(one_darray[-1])
print(one_darray[::-1])
print(one_darray[::-2])

[10 20 30 40 50]
10
20
[10 20 30]
[10 30]
50
[50 40 30 20 10]
[50 30 10]

In [83]:
#Operations on 2D array.
print(two_darray)
print(two_darray.ndim)
print(two_darray.shape)
print(two_darray.size)
print(two_darray.dtype)

[[ 1  2  3  4]
 [10  9  8  7]]
2
(2, 4)
8
int64

In [84]:
print(two_darray)
print(two_darray[0])
print(two_darray[1])
print(two_darray[0][0])
print(two_darray[0][3])
print(two_darray[:,1])
print(two_darray[:,3])

[[ 1  2  3  4]
 [10  9  8  7]]
[1 2 3 4]
[10  9  8  7]
1
4
[2 9]
[4 7]

In [85]:
#Operations on 3D array.
print(three_darray)
print(three_darray.ndim)
print(three_darray.shape)
print(three_darray.size)
print(three_darray.dtype)

[[[10 11 12]
  [13 14 15]]

 [[ 1  1  2]
  [ 3  4  5]]]
3
(2, 2, 3)
12
int64

In [86]:
print(three_darray)
print(three_darray[1][0])
print(three_darray[1][1])
print(three_darray[1][0][0])
print(three_darray[0][0])
print(three_darray[0][:,1])
print(three_darray[1][:,0])

[[[10 11 12]
  [13 14 15]]

 [[ 1  1  2]
  [ 3  4  5]]]
[1 1 2]
[3 4 5]
1
[10 11 12]
[11 14]
[1 3]

In [89]:
#General operations on a array.
print(two_darray)
print(two_darray.std())
print(two_darray.min())
print(two_darray.argmin())
print(two_darray.max())
print(two_darray.argmax())
print(two_darray.mean())
print(two_darray.sum())

[[ 1  2  3  4]
 [10  9  8  7]]
3.2015621187164243
1
0
10
4
5.5
44

In [93]:
#Matix Creation
print(np.zeros([3,3]))
print(np.identity(4))
print(np.full([3,3],6))
print(np.ones([3,3]))

[[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]
[[1. 0. 0. 0.]
 [0. 1. 0. 0.]
 [0. 0. 1. 0.]
 [0. 0. 0. 1.]]
[[6 6 6]
 [6 6 6]
 [6 6 6]]
[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]

In [94]:
a = [2,3.5,4.6,5]
print(np.cos(a))
print(np.sin(a))
print(np.exp(a))
print(np.floor(a))
print(np.ceil(a))

[-0.41614684 -0.93645669 -0.11215253  0.28366219]
[ 0.90929743 -0.35078323 -0.993691   -0.95892427]
[  7.3890561   33.11545196  99.48431564 148.4131591 ]
[2. 3. 4. 5.]
[2. 4. 5. 5.]

In [96]:
#Simple assignment
x = two_darray
print(x)
print(two_darray)
print(hex(id(x)))
print(hex(id(two_darray)))

[[ 1  2  3  4]
 [10  9  8  7]]
[[ 1  2  3  4]
 [10  9  8  7]]
0x10d24d9b0
0x10d24d9b0

In [97]:
x[0][0] = -1
print(x)
print(two_darray)

[[-1  2  3  4]
 [10  9  8  7]]
[[-1  2  3  4]
 [10  9  8  7]]

In [106]:
#Swallow copy.
y = two_darray.view()
print(y)
print(two_darray)
print(hex(id(y)))
print(hex(id(two_darray)))

[[ 1  2  3  4]
 [10  9  8  7]]
[[ 1  2  3  4]
 [10  9  8  7]]
0x10f853cf0
0x10d24d9b0

In [107]:
#Original data changes when variable data is changed.
y[0][0] = -1
print(y)
print(two_darray)

[[-1  2  3  4]
 [10  9  8  7]]
[[-1  2  3  4]
 [10  9  8  7]]

In [102]:
#Deep Copy.
z = two_darray.copy()
print(z)
print(two_darray)
print(hex(id(z)))
print(hex(id(two_darray)))

[[ 1  2  3  4]
 [10  9  8  7]]
[[ 1  2  3  4]
 [10  9  8  7]]
0x10c543c30
0x10d24d9b0

In [104]:
#Original data remains same here when variable data is changed.
z[0][0] = -1
print(z)
print(two_darray)

[[-1  2  3  4]
 [10  9  8  7]]
[[ 1  2  3  4]
 [10  9  8  7]]

In [108]:
#Ravel and flatten.
print(two_darray.ravel())
print(two_darray.flatten())
print(two_darray)

[-1  2  3  4 10  9  8  7]
[-1  2  3  4 10  9  8  7]
[[-1  2  3  4]
 [10  9  8  7]]

In [119]:
r = np.array([10,20,30,40,50,60])

In [120]:
#Reshape and Resize.
print(r.reshape(2,3))
print(r)

[[10 20 30]
 [40 50 60]]
[10 20 30 40 50 60]

In [121]:
#Resize changes the original data.
r.resize(2,3)
print(r)

[[10 20 30]
 [40 50 60]]

In [116]:
r.resize(2,3)

In [128]:
print(two_darray)
print('\n')
print(np.split(two_darray,2))
print('\n')
print(np.hsplit(two_darray,4))

[[-1  2  3  4]
 [10  9  8  7]]


[array([[-1,  2,  3,  4]]), array([[10,  9,  8,  7]])]


[array([[-1],
       [10]]), array([[2],
       [9]]), array([[3],
       [8]]), array([[4],
       [7]])]

In [132]:
print(r)
print('\n')
print(np.stack([r,r]))
print('\n')
print(np.hstack([r,r]))

[[10 20 30]
 [40 50 60]]


[[[10 20 30]
  [40 50 60]]

 [[10 20 30]
  [40 50 60]]]


[[10 20 30 10 20 30]
 [40 50 60 40 50 60]]

In [135]:
#Matrix Operations:
A = np.array([[1,2,3],[1,2,1],[3,2,4]])
B = np.array([1,3,5])
print(np.linalg.det(A))
print(np.linalg.inv(A))
print(np.trace(A))
print(np.transpose(A))
print(np.dot(np.linalg.inv(A),B))
print(np.linalg.solve(A,B))
print(np.linalg.eig(A))
print(np.linalg.eigvals(A))

-8.000000000000002
[[-0.75   0.25   0.5  ]
 [ 0.125  0.625 -0.25 ]
 [ 0.5   -0.5    0.   ]]
7
[[1 1 3]
 [2 2 2]
 [3 1 4]]
[ 2.5   0.75 -1.  ]
[ 2.5   0.75 -1.  ]
(array([ 6.6702759 , -0.94262618,  1.27235028]), array([[ 0.52476849,  0.87030724,  0.04635902],
       [ 0.28417566, -0.13477687, -0.82920816],
       [ 0.80241026, -0.4737093 ,  0.55701407]]))
[ 6.6702759  -0.94262618  1.27235028]

**ScipY**

In [136]:
from scipy.integrate import quad, dblquad
from scipy.optimize import minimize, root

In [146]:
def fun_1(x,a):
    return x**2 + a

In [147]:
quad(fun_1,0, 1, args = 2)

(2.3333333333333335, 2.590520390792032e-14)

In [153]:
def fun_2(x,y,a,b):
    return x**a + y**b

In [154]:
dblquad(fun_2,0,1,0,2, args = (2,2))

(3.333333333333334, 5.1714082159146356e-14)

In [157]:
def fun_3(x):
    return x**2 - 2

In [158]:
minimize(fun_3,1)

  message: Optimization terminated successfully.
  success: True
   status: 0
      fun: -2.0
        x: [-9.516e-09]
      nit: 2
      jac: [ 0.000e+00]
 hess_inv: [[ 5.000e-01]]
     nfev: 6
     njev: 3

In [162]:
root(fun_3,3)

 message: The solution converged.
 success: True
  status: 1
     fun: [ 5.773e-15]
       x: [ 1.414e+00]
    nfev: 9
    fjac: [[-1.000e+00]]
       r: [-2.828e+00]
     qtf: [-3.684e-09]

In [163]:
from scipy.stats import norm

In [166]:
norm.rvs(size = 10, loc = 0, scale = 1)

array([ 0.6488467 ,  1.06854636, -1.04864906, -0.44591314,  1.5994089 ,
        0.15722297, -1.27508919,  0.01121934, -1.06859509,  1.23968906])

In [175]:
norm.pdf(0.01,loc = 0, scale = 1)

0.39892233378608216

In [169]:
norm.cdf(10,loc = 0, scale = 1)

1.0

**Pandas**

In [176]:
import pandas as pd

In [177]:
#1.Series from a list
first_series = pd.Series(data = list('abcde'))
print(first_series)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [178]:
second_series = pd.Series(data = list('abcde'), index = list('fghij'))
print(second_series)

f    a
g    b
h    c
i    d
j    e
dtype: object

In [181]:
#2. Series from a array.
countries = np.array(['India', 'USA', 'UK'])
third_series = pd.Series(data = countries)
print(countries)
print('\n')
print(third_series)

['India' 'USA' 'UK']


0    India
1      USA
2       UK
dtype: object

In [183]:
#3. Series from a dictionary.
team_ranking = {'India': 1, 'Australia': 2, 'England': 3, 'Sri-Lanka': 4}
fourth_series = pd.Series(data = team_ranking)
print(team_ranking)
print('\n')
print(fourth_series)

{'India': 1, 'Australia': 2, 'England': 3, 'Sri-Lanka': 4}


India        1
Australia    2
England      3
Sri-Lanka    4
dtype: int64

In [187]:
gdp_countries = {'India': {2023:800, 2024: 1000}, 'USA': {2023: 1001, 2024: 1100}}
fifth_series = pd.Series(data = gdp_countries)
print(fifth_series)

India     {2023: 800, 2024: 1000}
USA      {2023: 1001, 2024: 1100}
dtype: object

In [186]:
#fifth_series = pd.DataFrame(data = gdp_countries)
#fifth_series

      India   USA
2023    800  1001
2024   1000  1100

In [188]:
#4. Scalar Series.
sixth_series = pd.Series(data = 5, index = range(0,10))
print(sixth_series)

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
9    5
dtype: int64

In [196]:
#Operations on series.
a = pd.Series([10,11,12,13,14,15], index = list('abcdef'))
print(a)

a    10
b    11
c    12
d    13
e    14
f    15
dtype: int64

In [203]:
#Same as in list.
print(a[0])
print(a[1])
print('\n')
print(a[0:3])
print(a[0:4:2])
print('\n')
print(a[-1])
print(a[::-1])
print(a[::-2])
print('\n')
print(a.iloc[0])
print(a.iloc[3])
print(a.loc['a'])
print(a.loc['f'])

10
11


a    10
b    11
c    12
dtype: int64
a    10
c    12
dtype: int64


15
f    15
e    14
d    13
c    12
b    11
a    10
dtype: int64
f    15
d    13
b    11
dtype: int64


10
13
10
15

In [205]:
x = pd.Series([1,2,3,4,5])
y = pd.Series([10,11,12,13,14])
print(x)
print(y)
print('\n')
print(x + y)
print('\n')
print(y - x)
print('\n')
print(y / x)
print('\n')
print(y % x)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    10
1    11
2    12
3    13
4    14
dtype: int64


0    11
1    13
2    15
3    17
4    19
dtype: int64


0    9
1    9
2    9
3    9
4    9
dtype: int64


0    10.00
1     5.50
2     4.00
3     3.25
4     2.80
dtype: float64


0    0
1    1
2    0
3    1
4    4
dtype: int64

In [222]:
z = pd.Series([1,2,3,4,5], index = [0,1,2,6,7])
print(z)
print(x)
c = x + z
print(c)

0    1
1    2
2    3
6    4
7    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64
0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
6    NaN
7    NaN
dtype: float64

In [223]:
print(c.fillna(0))
print(c)

0    2.0
1    4.0
2    6.0
3    0.0
4    0.0
6    0.0
7    0.0
dtype: float64
0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
6    NaN
7    NaN
dtype: float64

In [224]:
c.fillna(0, inplace = True)
print(c)

0    2.0
1    4.0
2    6.0
3    0.0
4    0.0
6    0.0
7    0.0
dtype: float64

In [225]:
#Data Frame
movie_data = pd.DataFrame(data = {'Movie_1': [1,2,3,4,5], 'Movie_2': [2,3,5,1,2]},
                         index = ['User_1','User_2','User_3','User_4','User_5'])
movie_data

        Movie_1  Movie_2
User_1        1        2
User_2        2        3
User_3        3        5
User_4        4        1
User_5        5        2

In [254]:
olympic_data = pd.DataFrame({'HostCity':np.array(['London','Beijing','Athens','Sydney','Atlanta']),
                       'Year':[2012,2008,2004,2000,1996],
                       'No_of_Participants':np.array([205,204,201,200,197])})
olympic_data

  HostCity  Year  No_of_Participants
0   London  2012                 205
1  Beijing  2008                 204
2   Athens  2004                 201
3   Sydney  2000                 200
4  Atlanta  1996                 197

In [227]:
sales_data = pd.DataFrame({'prod_id':[101,102,103,104,105,106,107,108,109,110],
                     'year':[2017,2018,2017,2018,2017,2018,2017,2018,2017,2018],
                     'sales':[192,321,456,383,100,898,999,125,665,330]})
sales_data

   prod_id  year  sales
0      101  2017    192
1      102  2018    321
2      103  2017    456
3      104  2018    383
4      105  2017    100
5      106  2018    898
6      107  2017    999
7      108  2018    125
8      109  2017    665
9      110  2018    330

In [235]:
#Operations on dataframe.
#Top 5 rows:
sales_data.head()

   prod_id  year  sales
0      101  2017    192
1      102  2018    321
2      103  2017    456
3      104  2018    383
4      105  2017    100

In [236]:
#Bottom 5 rows
sales_data.tail()

   prod_id  year  sales
5      106  2018    898
6      107  2017    999
7      108  2018    125
8      109  2017    665
9      110  2018    330

In [238]:
#Data frame information
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   prod_id  10 non-null     int64
 1   year     10 non-null     int64
 2   sales    10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

In [239]:
#Data Summary
sales_data.describe()

         prod_id         year       sales
count   10.00000    10.000000   10.000000
mean   105.50000  2017.500000  446.900000
std      3.02765     0.527046  312.425796
min    101.00000  2017.000000  100.000000
25%    103.25000  2017.000000  224.250000
50%    105.50000  2017.500000  356.500000
75%    107.75000  2018.000000  612.750000
max    110.00000  2018.000000  999.000000

In [230]:
#Slicing a column.
print(type(olympic_data.HostCity))
olympic_data.HostCity

<class 'pandas.core.series.Series'>

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [231]:
print(type(olympic_data['HostCity']))
olympic_data['HostCity']

<class 'pandas.core.series.Series'>

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [232]:
print(type(olympic_data[['HostCity']]))
olympic_data[['HostCity']]

<class 'pandas.core.frame.DataFrame'>

  HostCity
0   London
1  Beijing
2   Athens
3   Sydney
4  Atlanta

In [241]:
#Slicing mutiple columns.
olympic_data[['Host_City','Year']]

  Host_City  Year
0    London  2012
1   Beijing  2008
2    Athens  2004
3    Sydney  2000
4   Atlanta  1996

In [248]:
#First row of a dataframe
olympic_data.iloc[1]

Host_City          Beijing
Year                  2008
Participants_No        204
Name: 1, dtype: object

In [249]:
#Fetting records of first column.
olympic_data.iloc[:,1]

0    2012
1    2008
2    2004
3    2000
4    1996
Name: Year, dtype: int64

In [243]:
olympic_data.iloc[0:2]

  Host_City  Year  Participants_No
0    London  2012              205
1   Beijing  2008              204

In [245]:
olympic_data.iloc[2:4]

  Host_City  Year  Participants_No
2    Athens  2004              201
3    Sydney  2000              200

In [246]:
olympic_data.iloc[2:4,0:2]

  Host_City  Year
2    Athens  2004
3    Sydney  2000

In [240]:
#Change column Header.
olympic_data.columns = ['Host_City', 'Year', 'Participants_No']
olympic_data

  Host_City  Year  Participants_No
0    London  2012              205
1   Beijing  2008              204
2    Athens  2004              201
3    Sydney  2000              200
4   Atlanta  1996              197

In [255]:
#Change the column indexes.
olympic_data.index = olympic_data.Year
olympic_data

     HostCity  Year  No_of_Participants
Year
2012   London  2012                 205
2008  Beijing  2008                 204
2004   Athens  2004                 201
2000   Sydney  2000                 200
1996  Atlanta  1996                 197

In [256]:
#Rest index
olympic_data.reset_index(drop = True, inplace = True)
olympic_data

  HostCity  Year  No_of_Participants
0   London  2012                 205
1  Beijing  2008                 204
2   Athens  2004                 201
3   Sydney  2000                 200
4  Atlanta  1996                 197

In [258]:
def movie_grade_fun(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    elif rating == 2:
        return 'D'
    else:
        return 'E'

In [259]:
movie_data

        Movie_1  Movie_2
User_1        1        2
User_2        2        3
User_3        3        5
User_4        4        1
User_5        5        2

In [260]:
movie_data.applymap(movie_grade_fun)

       Movie_1 Movie_2
User_1       E       D
User_2       D       C
User_3       C       A
User_4       B       E
User_5       A       D

In [261]:
sales_data

   prod_id  year  sales
0      101  2017    192
1      102  2018    321
2      103  2017    456
3      104  2018    383
4      105  2017    100
5      106  2018    898
6      107  2017    999
7      108  2018    125
8      109  2017    665
9      110  2018    330

In [264]:
print(sales_data.sales.sum())
print(sales_data.sales.count())
print(sales_data.sales.min())
print(sales_data.sales.max())
print(sales_data.sales.std())
print(sales_data.sales.mean())
print(sales_data.sales.median())
#print(sales_data.sales.mode())

4469
10
100
999
312.42579563438386
446.9
356.5

In [269]:
sales_data.groupby(['year'])['sales'].sum()

year
2017    2412
2018    2057
Name: sales, dtype: int64

In [271]:
#Sorting the value of the table based on columns.
sales_data.sort_values('sales')

   prod_id  year  sales
4      105  2017    100
7      108  2018    125
0      101  2017    192
1      102  2018    321
9      110  2018    330
3      104  2018    383
2      103  2017    456
8      109  2017    665
5      106  2018    898
6      107  2017    999

In [273]:
#Value count of the column or frequency table of the categorical data.
sales_data.year.value_counts()

2017    5
2018    5
Name: year, dtype: int64

In [274]:
#Changing the data type of the column.
sales_data.prod_id = sales_data.prod_id.astype('str')
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   prod_id  10 non-null     object
 1   year     10 non-null     int64
 2   sales    10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

**Object Oriented Programming**

In [1]:
#Class is a template or blueprint of the real world object.
#Phone properties:
#1. cost
#2. colour
#Phone behaviour:
#1. Make call
#2. Play game

class Phone:
    def make_call(self):
        print('Make a phone call')
    def play_game(self):
        print('Play game')

In [2]:
p = Phone()

In [4]:
p.make_call()

Make a phone call

In [6]:
p.play_game()

Play game

In [9]:
class Phone:
    def set_colour(self, colour):
        self.colour = colour
    def set_cost(self, cost):
        self.cost = cost
    def show_colour(self):
        return self.colour
    def show_cost(self):
        return self.cost
    def make_call(self):
        print('Make a phone call')
    def play_game(self):
        print('Play game')

In [10]:
p = Phone()

In [11]:
p.set_colour('Red')
p.set_cost('100$')

In [13]:
p.show_colour()

'Red'

In [14]:
p.show_cost()

'100$'

In [15]:
#Using a constructor to assign variables.
class Employee:
    def __init__(self, Name, age, gender, salary):
        self.Name = Name
        self.age = age
        self.gender = gender
        self.salary = salary
    def show_employee_details(self):
        print('Name: {}'.format(self.Name))
        print('Age: {}'.format(self.age))
        print('Gender: {}'.format(self.gender))
        print('Salary: {}'.format(self.salary))

In [17]:
e = Employee('Mohit',31,'M',1000000)

In [18]:
e.show_employee_details()

Name: Mohit
Age: 31
Gender: M
Salary: 1000000

In [24]:
#Inheritence
#1.Single Inheritence
class Vehicle():
    def __init__(self, milage,cost):
        self.milage = milage
        self.cost = cost

    def show_vehicle_properties(self):
        print("I'm a Vehicle")
        print('Milage: {}'.format(self.milage))
        print('Cost: {}'.format(self.cost))
        
class Car(Vehicle):
    def __init__(self, milage, cost, colour, brand):
        super().__init__(milage, cost)
        self.colour = colour
        self.brand = brand
    def show_car_properties(self):
        print("I'm a car")
        print('Colour: {}'.format(self.colour))
        print('Brand: {}'.format(self.brand))

In [33]:
v = Vehicle('40 km/hr', '10000$')

In [34]:
v.show_vehicle_properties()

I'm a Vehicle
Milage: 40 km/hr
Cost: 10000$

In [35]:
c = Car('40 km/hr','1000$', 'Blue', 'Maruti')
c.show_car_properties()
print('\n')
c.show_vehicle_properties()

I'm a car
Colour: Blue
Brand: Maruti


I'm a Vehicle
Milage: 40 km/hr
Cost: 1000$

In [38]:
#2. Multiple inheritence.
class Parent_1():
    def Assign_1(self,one):
        self.one = one
    def show_1(self):
        return self.one
    
class Parent_2():
    def Assign_2(self,two):
        self.two = two
    def show_2(self):
        return self.two

class Parent_3(Parent_1,Parent_2):
    def Assign_3(self,three):
        self.three = three
    def show_3(self):
        return self.three

In [41]:
p = Parent_3()
p.Assign_1('1')
p.Assign_2('2')
p.Assign_3('3')
print(p.show_1())
print(p.show_2())
print(p.show_3())

1
2
3

In [ ]:
#Multilevel inheritence.